[{"id":1,"name":"New Year's Day","description":"New Year’s Day (Anul Nou) and the following day, on January 1 and 2 respectively, are annual holidays in Romania.","date":"2021-01-01"},{"id":2,"name":"Day after New Year's Day","description":"Both New Year’s Day (Anul Nou) and the following day, on January 1 and 2 respectively, are annual holidays in Romania.","date":"2021-01-02"},{"id":3,"name":"Unification Day","description":"Unification Day celebrates the political union between Wallachia and Moldavia, which is deemed as the foundation of modern Romania.","date":"2021-01-24"},{"id":4,"name":"Constantin Brancusi Day","description":"null","date":"2021-02-19"},{"id":5,"name":"Dragobete","description":"Dragobete is a folk holiday in Romania with ancient origins that centers on love and the return of spring.","date":"2021-02-24"},{"id":6,"name":"Mărțișor","description":"Mărțișor in Romania celebrates the start of spring. The name stems from the word March, which is “martie” in Romanian.","date":"2021-03-01"},{"id":7,"name":"International Women's Day","description":"Many people in Romania celebrate Women’s Day on March 8.","date":"2021-03-08"},{"id":8,"name":"Orthodox Good Friday","description":"Millions of Orthodox Christians around the world annually observe Good Friday to commemorate the events leading up to Jesus Christ's crucifixion.","date":"2021-04-30"},{"id":9,"name":"Labor Day / May Day","description":"Labor Day (Ziua muncii) is a national public holiday in Romania on May 1 each year.","date":"2021-05-01"},{"id":10,"name":"Orthodox Easter Day","description":"Easter (Paștele) is both a religious and a national holiday in Romania. The Easter date is based on the Orthodox Christian Church’s calendar.","date":"2021-05-02"},{"id":11,"name":"Mother's Day","description":"Many Romanians celebrate Mother’s Day (Ziua Mamei) on the first Sunday of May.","date":"2021-05-02"},{"id":12,"name":"Orthodox Easter Monday","description":"The Day after Easter (Paștele) is both a religious and a national holiday in Romania. The Easter date is based on the Orthodox Christian Church’s calendar.","date":"2021-05-03"},{"id":13,"name":"Father's Day","description":"Many Romanians celebrate Father’s Day (Ziua Tatălui) on the second Sunday of May.","date":"2021-05-09"},{"id":14,"name":"Monarchy Day","description":"null","date":"2021-05-10"},{"id":15,"name":"Children's Day","description":"Children’s Day (Ziua Copilului) is annually celebrated on June 1 in Romania.","date":"2021-06-01"},{"id":16,"name":"Orthodox Ascension Day","description":"Ascension Day (Înălțarea) is an annual observance in Romania to commemorate the Christian belief of Jesus Christ’s ascension into heaven.","date":"2021-06-10"},{"id":17,"name":"Orthodox Pentecost","description":"Many Christians in Romania celebrate the Pentecost (Rusalii or Rusaliile) public holiday, also known as Whitsunday or Whit Sunday.","date":"2021-06-20"},{"id":18,"name":"Orthodox Pentecost Monday","description":"Many Christians celebrate the Whit Monday (Rusalii or Rusaliile) public holiday in Romania.","date":"2021-06-21"},{"id":19,"name":"Flag Day","description":"Romania’s Flag Day (Ziua Tricolorului) is an annual observance on June 26.","date":"2021-06-26"},{"id":20,"name":"National Anthem Day","description":"Romania’s Anthem Day (Ziua Imnului Național) is an annual observance on July 29.","date":"2021-07-29"},{"id":21,"name":"St Mary's Day","description":"The feast day of the Assumption of Mary is a national holiday in Romania on August 15 every year.","date":"2021-08-15"},{"id":22,"name":"Halloween","description":"Some places in Romania, including in parts of Transylvania, have special Halloween events inspired by the Dracula theme on October 31.","date":"2021-10-31"},{"id":23,"name":"St Andrew's Day","description":"St Andrew’s Day (Ziua Sfântului Andrei) is a national holiday in Romania on November 30 every year.","date":"2021-11-30"},{"id":24,"name":"National holiday","description":"National Day in Romania, also called Unification Day, is an annual public holiday to remember when the country’s provinces became united on December 1, 1918.","date":"2021-12-01"},{"id":25,"name":"Constitution Day","description":"Romania’s Constitution Day is observed on December 8 every year.","date":"2021-12-08"},{"id":26,"name":"Christmas Eve","description":"Christmas Eve, or the day before Christmas Day, falls on December 24 every year in Romania.","date":"2021-12-24"},{"id":27,"name":"Christmas Day","description":"Christmas Day is a Christian holiday to celebrate Jesus Christ’s birth in Romania and falls on December 25 every year.","date":"2021-12-25"},{"id":28,"name":"Second day of Christmas","description":"The second day of Christmas falls on December 26 and is part of a two-day Christian holiday in Romania to celebrate Jesus Christ’s birth.","date":"2021-12-26"},{"id":29,"name":"New Year's Eve","description":"Many Romanians celebrate New Year’s Eve (Revelion) on December 31, the last day of the year in the Gregorian calendar.","date":"2021-12-31"}]